Tekla Open API Reference for Tekla Structures 2025
LayoutAttributes Class
 The LayoutAttributes class contains attributes for controlling the drawing layout.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.LayoutAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class LayoutAttributes : AttributesBase
<SerializableAttribute>
Public NotInheritable Class LayoutAttributes
	Inherits AttributesBase
The LayoutAttributes type exposes the following members.
Constructors
Name | Description
LayoutAttributes() |  Obsolete.
 Creates a new layout attributes instance that loads standard attributes.
LayoutAttributes(String) |  Obsolete.
 Creates a new layout attributes instance that loads drawing layout attributes from the specified attribute file.
LayoutAttributes(Drawing)
 Creates a new layout attributes instance that loads standard attributes.
LayoutAttributes(String, Drawing)
 Creates a new layout attributes instance that loads drawing layout attributes from the specified attribute file.
Top
Properties
Name | Description
AutoSizeOptions
 Gets or sets the auto size options that control the drawing sheet size. Setting this property will change the SizeDefinitionMode to AutoSize.
ListHiddenObjectsInTemplates
 Gets or sets the property for controlling whether to list hidden objects in templates.
SheetSize
 Gets or sets the sheet size. Setting this property will change the SizeDefinitionMode to SpecifiedSize.
SizeDefinitionMode
 Gets or sets the size definition mode.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads drawing layout attributes from the specified attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace
Tekla.Structures.Drawing.Drawing